nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/U4_485/Device_485.c
				   DwinLCD.Txinfo[2]=DwinLCD.TxInfolen-3;  //   补填  
				    rt_device_write(&Device_485,0,( const char*)DwinLCD.Txinfo,DwinLCD.TxInfolen);   	

				       rt_kprintf("\r\n Dwin:");   
				   for(i=0;i<DwinLCD.TxInfolen;i++)  
				         rt_kprintf(" %02X",DwinLCD.Txinfo[i]);        
				   rt_kprintf("\r\n");	 

	                       break;
	   default :
	   	                return;

	}
       //-------------------------
   DwinLCD.Type=LCD_IDLE;          
   DwinLCD.TxInfolen=0;  // 信息长度	     
	//------------------------
}
#endif

#ifdef LCD_5inch
 void DwinLCD_init(void) 
 {
   DwinLCD.CounterTimer=0;
   DwinLCD.Enable_Flag=1;      //   初始化Enable
   DwinLCD.Type=LCD_IDLE;          //  速度方向
   DwinLCD.TxInfolen=0;  // 信息长度
   memset(DwinLCD.Txinfo,0,sizeof(DwinLCD.Txinfo));  

 }

void  DwinLCD_DispTrigger(void)
{
                     #ifdef  LCD_5inch                                              
				if((time_now.sec==30)&&(DwinLCD.Type==LCD_IDLE))  
					     DwinLCD.Type=LCD_SETTIME;   
				else
				if(((time_now.sec%10)==6)&&(DwinLCD.Type==LCD_IDLE))  
				           DwinLCD.Type=LCD_GPSNUM;
			       else
				if((time_now.sec%10==4)&&(DwinLCD.Type==LCD_IDLE))    
  				 	     DwinLCD.Type=LCD_GSMNUM; 
			      if((time_now.sec%5==0)&&(DwinLCD.Type==LCD_IDLE))     
				        DwinLCD.Type=LCD_SETSPD;       
                             #endif  
}

void  DwinLCD_work_Enable(void)
{ 
     DwinLCD.Enable_Flag=1; 
}
void  DwinLCD_work_Disable(void)
{ 
      DwinLCD.Enable_Flag=0; 
}

void  DwinLCD_Timer(void)
{
    if(DwinLCD.Enable_Flag==1)  
    {
          DwinLCD.CounterTimer++;
	   if(	 DwinLCD.CounterTimer>=8)
	   	{
                      DwinLCD_Send();  
			 DwinLCD.CounterTimer=0;	    
 	   	}

    }	
}

void  DwinLCD_Data_Process(void) 
{
     u16   ADD_ID=0,i=0; 
     u16   ContentLen=0;// 实体信息长度
     u8    dwin_reg[50],endtailFlag=0;
     
         //AA 55 08 83 30 00 02 1E FF FF 00               
         //      08 是长度       83  : 指令  33 00 : 地址   02 1E FF FF 00: 内容 

       if(!DwinLCD.Process_Enable)
   	      return   ;   
	 DwinLCD.Process_Enable=0; // clear  
	//   Debug
	rt_kprintf("\r\n DwinLCD Rx:");
	 for(ADD_ID=0;ADD_ID<(DwinLCD.RxInfolen+3);ADD_ID++)
	 	rt_kprintf("%2X ",DwinLCD.RxInfo[ADD_ID]); 
	rt_kprintf("\r\n "); 
     
     if(DwinLCD.RxInfolen>=3)
     	{
                 ContentLen=DwinLCD.RxInfolen-3;
                 ADD_ID=((u16)DwinLCD.RxInfo[4]<<8)+(u16)DwinLCD.RxInfo[5];   

             //   Get useful  infomation    
                  memset(dwin_reg,0,sizeof(dwin_reg));
		    for(i=0;i<ContentLen;i++)				  
		    	{
		    	     if(DwinLCD.RxInfo[6+i]==0xFF)
			     {		
			         switch(endtailFlag)
				   {   case 0:							   
			                            endtailFlag=1;  // 有一个FF
							break;
					case  1:
						       endtailFlag=2; // 有2个 FF 结束了
						       break;
					default:
                                                       return;   // 异常情况返回不处理
				  }	 
		    	      }		
			    else		 
		    	        dwin_reg[i]=DwinLCD.RxInfo[6+i]; 
			    //----------------------------------	
                                  if(endtailFlag==2)
					break;
		    	}
			 
            switch(ADD_ID)
            	{
                  case 0x3000:// 车牌号输入   AA 55 0E 83 30 00 05 BD F2 41 37 37 38 38 FF FF 00
                                    /* 
                                       //------------------------------------------------------------ 
					    memset((u8*)&Vechicle_Info.Vech_Num,0,sizeof(Vechicle_Info.Vech_Num));	//clear	
					   memcpy(Vechicle_Info.Vech_Num,dwin_reg,strlen((const char*)dwin_reg));
					   Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));    
					    //------------------------------------------------------------				   
                                       rt_kprintf("\r\n Dwin设置车牌号:%s",dwin_reg);
					   */ 				   
						
				         break;
		    case 0x3200: // APN        AA 55 14 83 32 00 08 77 77 77 2E 62 61 69 64 75 2E 63 6F 6D FF FF 00
                                  /*    memset(APN_String,0,sizeof(APN_String));					  
					  memcpy(APN_String,(char*)dwin_reg,strlen((const char*)dwin_reg));  
					  memset((u8*)SysConf_struct.APN_str,0,sizeof(APN_String));	
					  memcpy((u8*)SysConf_struct.APN_str,(char*)dwin_reg,strlen((const char*)dwin_reg));    
					 Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));


                                     DataLink_APN_Set(APN_String,1); 
                                     */
			               break;
		    case  0x3300:// IP	        AA 55 12 83 33 00 07 31 39 32 2E 31 36 38 2E 31 2E 31 32 FF FF	   
                                    //-------------------------------------------------------------------------
				      /*  i = str2ipport((char*)dwin_reg, RemoteIP_main, &RemotePort_main);
					  if (i <= 4) break;;
					   
					  memset(dwin_reg,0,sizeof(dwin_reg));
					  IP_Str((char*)dwin_reg, *( u32 * ) RemoteIP_main);		   
					  strcat((char*)dwin_reg, " :"); 	  
					  sprintf((char*)dwin_reg+strlen((const char*)dwin_reg), "%u\r\n", RemotePort_main);  
				         memcpy((char*)SysConf_struct.IP_Main,RemoteIP_main,4);
					  SysConf_struct.Port_main=RemotePort_main;
					 Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));

				        DataLink_MainSocket_set(RemoteIP_main,RemotePort_main,1);
						 DataLink_EndFlag=1; //AT_End();  
					*/	 
                                  //--------------------------------------------------------------------------

                                    break;
		    case  0x0999:// 拍照  AA 55 06 83 09 99 01 00 03

					 break;
		    case  0x0004://车辆信息 AA 55 06 83 00 04 01 00 02
		                         //                       AA 55 06 83 00 04 01 00 02 
                                     DwinLCD.Type=LCD_VechInfo; 
			               break;
		    default:
				        break;

            	}


     	}
     else
	 	return;  
}
#endif

//=====================================================

void  Photo_TakeCMD_Update(u8 CameraNum)
{
      Take_photo[4]=CameraNum;    // Set take  Camra  Num
      Take_photo[5]=0x00;
}

void  Photo_FetchCMD_Update(u8 CameraNum)
{
     Fectch_photo[4]=CameraNum; // Set  fetch  Camra  Num 
     Fectch_photo[5]=0x00;
}

void _485_delay_us(u16 j)
{
u8 i;
  while(j--)
  	{
  	i=3;
  	while(i--);
  	}  
}
void _485_delay_ms(u16 j)
{
  while(j--)
  	{
         _485_delay_us(1000);   
  	} 
   
